{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film centers on Cobb (Leonardo DiCaprio), a professional “extractor” who pulls secrets from people’s subconscious by infiltrating their dreams. He is offered a chance to clear his criminal record if he can plant a new idea—an “inception”—into the mind of a target. Cobb assembles a team to carry out this high‑stakes, multi‑layered dream‑heist while wrestling with his own memories and the blurred boundary between reality and dream.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6685997248,false],["What company produced Inception?","The film was produced by **Warner Bros. Pictures in partnership with Legendary Pictures**.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.5775003433,false],["When was The Dark Knight released?","The Dark Knight was released in theaters in **July 2008**.","The Dark Knight was released in 2008.",0.9253866076,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.8685994148,true],["What is Deadpool’s real name in the film?","Deadpool’s real name in the film is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.9694764018,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes – after Disney’s acquisition of 21st Century Fox, the rights to Deadpool were returned to Marvel Studios, and the character has been integrated into the Marvel Cinematic Universe.  In particular, “Deadpool & Wolverine” was released in 2024 as part of Phase V of the MCU, confirming that Deadpool is now part of the MCU franchise.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7256154418,true],["What is the narrator's mental condition in Fight Club?","The narrator is portrayed as suffering from dissociative identity disorder (he has a split personality—Tyler Durden—and experiences dissociation), compounded by severe insomnia and emotional distress.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.9035341144,true],["Who are the main actors in Pulp Fiction?","The principal cast of *Pulp Fiction* (as listed in the provided context) includes:\n\n- **John Travolta** – Vincent Vega  \n- **Samuel L. Jackson** – Jules Winnfield  \n- **Uma Thurman** – Mia Wallace  \n- **Tim Roth** – Ringo\/Pumpkin  \n- **Ving Rhames** – Marsellus Wallace  \n- **Bruce Willis** – (listed as part of the main cast in the opening paragraph)\n\nThese actors carry the film’s central, interwoven storylines.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6123132706,false],["Who is Butch Coolidge?","Butch Coolidge is an aging professional boxer who appears in Quentin Tarantino’s *Pulp Fiction*.  He is portrayed by Bruce Willis and is on the run from crime boss Marsellus Wallace after double‑crossing him in a boxing match.  The film follows his attempts to escape, his encounter with the pawn shop “Maynard” crew, and his eventual decision to rescue Marsellus, for which he uses a katana.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8280113339,true]]}