{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows a professional thief—played by Leonardo DiCaprio—who specializes in entering people’s dreams to steal information. He is offered a chance to have his criminal record wiped clean in exchange for performing the reverse operation: implanting an idea into the mind of a target through a complex, multi‑layered dreamscape. As he assembles a team to pull off this “inception,” the story follows their attempts to navigate the different dream levels, deal with psychological obstacles, and ultimately succeed in planting the idea.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6528922319,false],["What company produced Inception?","Warner Bros.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.3878104687,false],["When was The Dark Knight released?","The Dark Knight was first released in Australia and Taiwan on **Wednesday, July 16, 2008**.","The Dark Knight was released in 2008.",0.8341289759,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker.","Rachel Dawes dies in an explosion set up by the Joker.",0.4406607151,false],["What is Deadpool’s real name in the film?","Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.640912056,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. According to the information provided, Deadpool is being integrated into the Marvel Cinematic Universe. After Disney’s acquisition of Fox, the studio confirmed that future Deadpool projects—starting with the third film—will be developed under Marvel Studios and set within the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7516186237,true],["What is the narrator's mental condition in Fight Club?","I cannot answer that question.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.1473713666,false],["Who are the main actors in Pulp Fiction?","I cannot answer that question.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.0189862512,false],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer who appears in Quentin Tarantino’s *Pulp Fiction*. In the film he has double‑crossed Marsellus Wallace and is pursued by him; the character is played by Bruce Willis. The role was originally written for Matt Dillon, but Willis ultimately portrayed the gritty, street‑smart fighter who eventually leaves Los Angeles.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8499405384,true]]}