{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb (Leonardo DiCaprio), a skilled “extractor” who steals secrets by entering people’s dreams. He is offered a chance to clear his criminal record if he can successfully plant an idea into a target’s subconscious—an elaborate heist that takes place inside layers of dreams. The story tracks Cobb’s attempt to execute this impossible job while dealing with personal demons and the blurred line between reality and sleep.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.6819252968,false],["What company produced Inception?","Warner Bros. Pictures produced *Inception*.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.8692702651,true],["When was The Dark Knight released?","The Dark Knight premiered on **July 14, 2008** in New York City’s IMAX, and it opened in Australia and Taiwan on **July 16, 2008** (rolling into a total of twenty markets by the weekend).","The Dark Knight was released in 2008.",0.7876095772,true],["Who kills Rachel Dawes in The Dark Knight?","Rachel Dawes is killed by the Joker’s explosives. The Joker sets up a trap that detonates, and the resulting explosion kills her.","Rachel Dawes dies in an explosion set up by the Joker.",0.912710309,true],["What is Deadpool’s real name in the film?","I cannot answer that question.","Deadpool’s real name is Wade Wilson.",0.0787550211,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of 21st Century Fox, Deadpool’s film rights were returned to Marvel Studios, and the character has since been integrated into the Marvel Cinematic Universe. This is evidenced by the release of **“Deadpool & Wolverine”** (July 26, 2024) as part of Phase Five of the MCU, indicating that Deadpool is now officially part of the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7531023026,true],["What is the narrator's mental condition in Fight Club?","I cannot answer that question.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.1473713666,false],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are John Travolta, Samuel L. Jackson, Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.7336192727,true],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer in Quentin Tarantino’s *Pulp Fiction*.  He double‑crosses Marsellus Wallace by winning a fight he shouldn’t have, then flees to avoid retribution.  The character is portrayed by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.882723093,true]]}