{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb and his team of “extractors,” specialists who use a dream‑sharing device to enter people’s subconscious and steal or plant information. After proving his skill to the wealthy businessman Saito, Cobb is hired to carry out an impossible task: to implant an idea in the mind of Robert Fischer, the heir to Saito’s rival, with the goal of dissolving Fischer’s father’s company. Cobb assembles a crew—Eames the forger, Yusuf the chemist, and Ariadne, a student who designs dream architecture—to create a complex, three‑layer shared dream on a transatlantic flight. Each layer runs at a slower time scale than the one above, and the team must coordinate “kicks” (synchronized jolts) to wake up. Throughout the mission, Cobb must also confront the lingering influence of his late wife Mal, whose presence in his subconscious threatens to sabotage the operation. The story follows the team’s efforts to successfully plant the idea while navigating the blurred boundaries between reality and the dream world.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.5799058676,false],["What company produced Inception?","I cannot answer that question.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.1196868718,false],["When was The Dark Knight released?","The Dark Knight was released as a film in 2008, and its home‑media (DVD\/Blu‑ray) release came out in December 2008.","The Dark Knight was released in 2008.",0.9188295603,true],["Who kills Rachel Dawes in The Dark Knight?","I cannot answer that question.","Rachel Dawes dies in an explosion set up by the Joker.",0.03785206,false],["What is Deadpool’s real name in the film?","I cannot answer that question.","Deadpool’s real name is Wade Wilson.",0.0787550211,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes – following Disney’s acquisition of Fox, Deadpool was announced to be integrated into the Marvel Cinematic Universe (MCU). The third film in the franchise was confirmed to be a Marvel Studios production set in the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7806140184,true],["What is the narrator's mental condition in Fight Club?","The narrator’s mental state in *Fight Club* is depicted as one of acute emotional distress and psychological fragmentation. He suffers from chronic insomnia and deep dissatisfaction with his life, which drives him to seek false emotional outlets in support groups. This turmoil culminates in the emergence of a dissociative alter‑ego—Tyler Durden—who represents an extreme, Nietzschean version of the narrator’s desires. Thus, the film portrays him as dealing with severe insomnia, emotional instability, and a form of dissociative identity disorder.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.6202981472,false],["Who are the main actors in Pulp Fiction?","The principal performers in the film, as noted in the context, are:\n\n- **John Travolta**  \n- **Samuel L. Jackson**  \n- **Tim Roth**  \n- **Amanda Plummer** (co‑star)  \n\nDanny DeVito is mentioned as an executive producer, and Daniel Day‑Lewis was only considered for a role but did not appear in the final cast.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6744797826,false],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer who double‑crosses crime boss Marsellus Wallace and then goes on the run from him. He is a key character in Tarantino’s film, portrayed by Bruce Willis.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8853884935,true]]}