{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","**Main Plot Summary**\n\nInception follows Dom Cobb (Leonardo DiCaprio), a skilled thief who specializes in “dream‑stealing” – infiltrating people’s subconscious to extract secrets. After a high‑stakes job leaves him stranded in exile, he is offered a chance to have his criminal record cleared if he can complete one impossible task: implant an idea into a target’s mind rather than steal it. Cobb assembles a team and plans a complex heist inside multiple layers of dream‑worlds, confronting both external threats and the blurred boundaries between reality and the subconscious. The film centers on this elaborate, mind‑bending mission and its psychological and philosophical implications.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.8282080293,true],["What company produced Inception?","I cannot answer that question.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.1196868718,false],["When was The Dark Knight released?","I cannot answer that question.","The Dark Knight was released in 2008.",0.1039161235,false],["Who kills Rachel Dawes in The Dark Knight?","The Joker is the one who kills Rachel Dawes in *The Dark Knight*.","Rachel Dawes dies in an explosion set up by the Joker.",0.7477455735,true],["What is Deadpool’s real name in the film?","Wade Wilson.","Deadpool’s real name is Wade Wilson.",0.640912056,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After Disney’s acquisition of 21st Century Fox, the Deadpool film rights were returned to Marvel Studios, and the character was incorporated into the Marvel Cinematic Universe.  The 2024 film *Deadpool & Wolverine* is part of Phase Five of the MCU, confirming Deadpool’s inclusion in the broader Marvel cinematic continuity.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7154119015,true],["What is the narrator's mental condition in Fight Club?","The Narrator is portrayed as suffering from a combination of severe insomnia and dissociative identity disorder (split‑personality). He is an unreliable narrator who gradually realizes that Tyler Durden is a mental projection of himself—a distinct alter‑ego that embodies his repressed anger and desire for rebellion. This split personality drives the story’s conflict and eventual revelation that the Narrator and Tyler are, in fact, two sides of the same disturbed mind.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8673951626,true],["Who are the main actors in Pulp Fiction?","The principal cast of **“Pulp Fiction”** is:\n\n- **John Travolta** as Vincent Vega  \n- **Samuel L. Jackson** as Jules Winnfield  \n- **Uma Thurman** as Mia Wallace  \n- **Harvey Keitel** as Winston Wolfe  \n- **Bruce Willis** as Butch Coolidge  \n\n(Other key actors include Tim Roth as Ringo\/Pumpkin and Ving Rhames as Marsellus Wallace, but the five listed above are the main stars.)","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.5445758104,false],["Who is Butch Coolidge?","Butch Coolidge is the boxer‑turned‑criminal in *Pulp Fiction*.  He wins a fight for the crime boss Marsellus Wallace, then double‑crosses him by refusing to keep the money he earned.  He is seen with his girlfriend Fabienne, who forgets a gold watch, and ultimately ends up in a violent shoot‑out with Wallace’s henchmen.  In the film, his character is portrayed as a tough, street‑smart fighter who is willing to betray those who employ him in order to protect himself and his loved ones.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.76289469,true]]}