{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The main plot of **Inception** follows Dom Cobb, a skilled “extractor” who steals secrets from people’s subconscious while they dream. Saito, a powerful businessman, hires Cobb to perform the reverse operation—implant an idea into a target’s mind (an “inception”) so that Robert Fischer, the heir to a rival company, will decide to dissolve his father’s business. Cobb assembles a team (Eames the forger, Yusuf the chemist, and Ariadne the architect) and they craft a multi‑layered dream world aboard a plane. Each layer runs slower than the one above, allowing the team to coordinate a synchronized “kick” to wake everyone at once. As they navigate deeper, they face subconscious defenses, a dangerous “Limbo” realm, and the haunting memory of Cobb’s dead wife, Mal. The climax involves Cobb rescuing both Saito and Fischer from Limbo and planting the idea in Fischer’s mind, while the team synchronizes the kicks to return to reality. In the end, Cobb is reunited with his children, having fulfilled Saito’s promise of a clean slate.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7666797638,true],["What company produced Inception?","Warner Bros. produced *Inception*.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.8487920761,true],["When was The Dark Knight released?","I cannot answer that question.","The Dark Knight was released in 2008.",0.1039161235,false],["Who kills Rachel Dawes in The Dark Knight?","Rachel Dawes is killed by the Joker’s plan—the explosion set off by the Joker takes her life.","Rachel Dawes dies in an explosion set up by the Joker.",0.9227879643,true],["What is Deadpool’s real name in the film?","I cannot answer that question.","Deadpool’s real name is Wade Wilson.",0.0787550211,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes – after Disney’s acquisition of 20th Century Fox, Deadpool was announced as a property that would be integrated into the Marvel Cinematic Universe. The third Deadpool film, being produced by Marvel Studios, is explicitly set in the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.736143589,true],["What is the narrator's mental condition in Fight Club?","The narrator is portrayed as suffering from a dissociative identity disorder – he has a split personality, with one side represented by Tyler Durden, and his own voice is unreliable and fragmented as a result.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.898724556,true],["Who are the main actors in Pulp Fiction?","Based on the provided information, the main actors highlighted are:\n\n- **John Travolta**  \n- **Samuel L. Jackson**  \n- **Bruce Willis**  \n- **Harvey Keitel**","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.8877741098,true],["Who is Butch Coolidge?","Butch Coolidge is the protagonist in *Pulp Fiction*. He is an underground boxer who double‑crosses Marsellus Wallace after winning a fight, plans to flee with his girlfriend Fabienne, and navigates a series of violent confrontations that ultimately lead him to save Marsellus and escape Los Angeles.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.7589620948,true]]}