{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","In *Inception* follows Dom Cobb (Leonardo DiCaprio), a skilled “extractor” who specializes in infiltrating people’s dreams to steal or plant ideas.  After years of living as a fugitive, Cobb is offered a chance to clear his criminal record: he must pull off an impossible “inception” – the implantation of a new idea into the mind of a target by taking the target through several nested dream layers.  The story follows Cobb’s efforts to assemble a team, navigate the fragile logic of dream‑within‑dream, and confront his own personal guilt while trying to complete the heist and return to reality.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.8350055218,true],["What company produced Inception?","I cannot answer that question.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.1196868718,false],["When was The Dark Knight released?","The Dark Knight was released on DVD and Blu‑ray in December 2008.","The Dark Knight was released in 2008.",0.9139530063,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker kills Rachel Dawes.","Rachel Dawes dies in an explosion set up by the Joker.",0.8685994148,true],["What is Deadpool’s real name in the film?","I cannot answer that question.","Deadpool’s real name is Wade Wilson.",0.0787550211,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. After 21st Century Fox was acquired by Disney, the Deadpool character’s film rights were returned to Marvel Studios, and the series has since been integrated into the MCU. The 2024 film *Deadpool & Wolverine* is part of Phase Five of the MCU, and Deadpool 3 is being produced as a Marvel Studios feature.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.7474918365,true],["What is the narrator's mental condition in Fight Club?","The narrator suffers from dissociative identity disorder—a split‑personality condition in which his alter‑ego, Tyler Durden, is a separate, often dominant identity that ultimately drives much of the film’s plot.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.9333686829,true],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are John Travolta (Vincent Vega), Samuel L. Jackson (Jules Winnfield), Bruce Willis, Tim Roth, Ving Rhames, and Uma Thurman.","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6832003593,false],["Who is Butch Coolidge?","Butch Coolidge is the aging, hard‑boiled boxer who appears in Quentin Tarantino’s 1994 film *Pulp Fiction*. He’s a former champion who has double‑crossed crime boss Marsellus Wallace, forcing the gangster to hunt him down. The character is portrayed by Bruce Willis, who had to give up a larger salary to play the role. Butch is known for his gritty streetwise demeanor and his later choice of a katana over a firearm to survive the violent events that follow his betrayal.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8122502565,true]]}