{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","I cannot answer that question.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.1544397175,false],["What company produced Inception?","The film was produced by **Warner Bros. Pictures**.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.5370783806,false],["When was The Dark Knight released?","The Dark Knight opened in cinemas on **July 16, 2008** (in Australia and Taiwan).","The Dark Knight was released in 2008.",0.7826644182,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker is the one who kills Rachel Dawes in *The Dark Knight*.","Rachel Dawes dies in an explosion set up by the Joker.",0.7477455735,true],["What is Deadpool’s real name in the film?","I cannot answer that question.","Deadpool’s real name is Wade Wilson.",0.0787550211,false],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. Deadpool’s films are now part of the Marvel Cinematic Universe, with *Deadpool & Wolverine* (2024) officially integrated into Phase Five of the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6327023506,false],["What is the narrator's mental condition in Fight Club?","The narrator suffers from dissociative identity disorder (multiple‑personality disorder), as evidenced by his split personality with Tyler Durden, and he also struggles with chronic insomnia.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.8655991554,true],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are:\n\n- John Travolta  \n- Samuel L. Jackson  \n- Uma Thurman  \n- Bruce Willis  \n- Tim Roth  \n- Ving Rhames","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.7137565017,true],["Who is Butch Coolidge?","Butch Coolidge is a boxer who appears in *Pulp Fiction*. He is a character played by Bruce Willis; in the film he double‑crosses Marsellus Wallace by winning a fight and then, in a desperate attempt to escape, kills his opponent. His storyline involves a car accident, a pawnshop, and a confrontation with Marsellus and his henchmen.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8690514565,true]]}