{"columns":["question","reply","expected_reply","sim","is_correct"],"data":[["What is the main plot of Inception?","The film follows Dom Cobb (Leonardo DiCaprio), a professional “extractor” who steals secrets by entering people’s subconscious while they sleep. Cobb is offered a chance to have his criminal past wiped clean, but only if he can reverse the job—plant an idea deep within a target’s mind (a process called an *inception*). To pull this off, he assembles a team of specialists and ventures into multiple layers of shared dreams, battling both the subconscious defenses of the target and the complications of their own memories, all while trying to stay grounded in reality. The story centers on this high‑stakes heist, the blurred boundary between dream and waking life, and Cobb’s personal struggle to return home to his children.","Inception follows Dom Cobb, a thief who steals information by infiltrating the subconscious, as he is hired to plant an idea into a target's mind.",0.7447693348,true],["What company produced Inception?","Warner Bros. (in partnership with Legendary Pictures) produced *Inception*.","Inception was produced by Legendary Pictures and Syncopy and distributed by Warner Bros.",0.8286356926,true],["When was The Dark Knight released?","The Dark Knight opened worldwide on **16 July 2008** (for example, it was released in Australia and Taiwan on that date).","The Dark Knight was released in 2008.",0.8118456602,true],["Who kills Rachel Dawes in The Dark Knight?","The Joker is the one responsible for Rachel Dawes’s death in *The Dark Knight*.","Rachel Dawes dies in an explosion set up by the Joker.",0.8170185089,true],["What is Deadpool’s real name in the film?","Deadpool’s real name is **Wade Wilson**.","Deadpool’s real name is Wade Wilson.",0.986653626,true],["Is Deadpool part of the Marvel Cinematic Universe (MCU)?","Yes. Deadpool is part of the Marvel Cinematic Universe. In December 2019 Reynolds confirmed a third Deadpool film was being developed by Marvel Studios, and in January 2021 Kevin Feige reiterated that the film would be set in the MCU. The resulting movie, **Deadpool & Wolverine**, released July 26 2024 as part of Phase Five of the MCU.","Deadpool is originally part of the X-Men universe by Fox, but he is expected to join the MCU following Disney’s acquisition of Fox.",0.6943794489,false],["What is the narrator's mental condition in Fight Club?","The narrator in *Fight Club* is depicted as having a serious mental disorder that includes chronic insomnia, depressive symptoms, and a dissociative‑identity‑type split. He is unable to articulate a sense of self, and as a result he projects an alternate personality—Tyler Durden—into his own consciousness. The film portrays him as an unreliable narrator who is unaware of this split until the story’s climax, suggesting a dissociative identity disorder (or a similar dissociative break) alongside his underlying anxiety and depressive state.","The narrator suffers from dissociative identity disorder, with Tyler Durden being an alternate personality.",0.6887960434,false],["Who are the main actors in Pulp Fiction?","The main actors in *Pulp Fiction* are:\n\n- **John Travolta**  \n- **Samuel L. Jackson**  \n- **Bruce Willis**  \n- **Tim Roth**  \n- **Ving Rhames**  \n- **Uma Thurman**","The main actors include John Travolta, Samuel L. Jackson, Uma Thurman, and Bruce Willis.",0.6868047714,false],["Who is Butch Coolidge?","Butch Coolidge is an aging boxer who appears in *Pulp Fiction*. Portrayed by Bruce Willis, he double‑crosses crime boss Marsellus Wallace after winning a fight, leading to a tense cat‑and‑mouse chase that culminates in a showdown at a pawnshop and a final, desperate attempt to escape with his girlfriend Fabienne. The character is known for his rough, 1950s‑style look and his conflict over a cherished gold watch that belonged to his father.","Butch Coolidge, played by Bruce Willis, is a boxer who double-crosses Marsellus Wallace by not throwing a fight.",0.8355792761,true]]}